---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.AtomTouchedNotAllowed
source: html/004161a3-2f19-89de-6478-3d7441123235.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.AtomTouchedNotAllowed Property

Changes to groups are only allowed during Edit Group mode. Use Edit Group to make this change.

## Syntax (C#)
```csharp
public static FailureDefinitionId AtomTouchedNotAllowed { get; }
```